In [1]:
# %matplotlib inline
import pandas as pd

### Connect Pandas to the database with this URL:

In [2]:
 titles = pd.read_csv('data/titles.csv')
 titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
 cast = pd.read_csv('data/cast.csv')
 cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [4]:
len(titles)

232330

### What are the earliest two films listed in the titles dataframe?

In [5]:
titles_1 = titles.sort_values(by='year')

In [6]:
titles_1["title"].iloc[0:2]

177757            Miss Jerry
215272    The Startled Lover
Name: title, dtype: object

### How many movies have the title "Hamlet"?

In [7]:
titles_2 = titles["title"]
titles_2.value_counts()["Hamlet"]

18

In [8]:
len(titles[titles["title"] == "Hamlet"])

18

### How many movies are titled "North by Northwest"?

In [9]:
titles_3 = titles["title"]
titles_3.value_counts()["North by Northwest"]

1

In [10]:
len(titles[titles["title"] == "North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [11]:
titles_4 = titles[titles["title"] == "Hamlet"]
titles_5 = titles_4.sort_values(by='year')
titles_5['year'].iloc[0]

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [12]:
titles_6 = titles[titles["title"] == "Treasure Island"]
titles_7 = titles_6.sort_values(by='year')
titles_7

                  title  year
206027  Treasure Island  1918
51287   Treasure Island  1920
191050  Treasure Island  1934
96934   Treasure Island  1950
89534   Treasure Island  1972
111343  Treasure Island  1973
205397  Treasure Island  1985
179354  Treasure Island  1999

### How many movies were made in the year 1950?

In [13]:
titles.dtypes

title    object
year      int64
dtype: object

In [14]:
titles_8 = titles[titles["year"] == 1950]
len(titles_8)

1099

### How many movies were made in the year 1960?

In [15]:
titles_9 = titles[titles["year"] == 1960]
len(titles_9)

1501

### How many movies were made from 1950 through 1959?

In [16]:
titles_10 = titles[(titles["year"] >= 1950) & (titles["year"] <= 1959)]
len(titles_10)

12711

### In what years has a movie titled "Batman" been released?

In [17]:
titles_11 = titles[titles["title"] == "Batman"]
titles_11['year'].sort_values()

74608    1943
56000    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [18]:
cast_1 = cast[cast["title"] == "Inception"]
len(cast_1)

77

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [19]:
cast_1 = cast[cast["title"] == "Inception"]
cast_2 = cast_1[cast_1['n'].isna() == True]
len(cast_2)

26

### But how many roles in the movie "Inception" did receive an "n" value?

In [20]:
cast_1 = cast[cast["title"] == "Inception"]
cast_3 = cast_1[cast_1['n'].notna() == True]
len(cast_3)

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [21]:
cast_4 = cast[cast["title"] == "North by Northwest"]
cast_5 = cast_4.dropna(subset = ['n'])
cast_6 = cast_5.sort_values(by='n')
cast_6[['name', 'n']]

                         name     n
845516             Cary Grant   1.0
3382934       Eva Marie Saint   2.0
1413409           James Mason   3.0
3043261   Jessie Royce Landis   4.0
345822         Leo G. Carroll   5.0
2941468  Josephine Hutchinson   6.0
1644542           Philip Ober   7.0
1236791         Martin Landau   8.0
2372617         Adam Williams   9.0
1757154          Edward Platt  10.0
646039      Robert Ellenstein  11.0
2225858          Les Tremayne  12.0
450691        Philip Coolidge  13.0
1463316         Patrick McVey  14.0
199768           Edward Binns  15.0
1343025             Ken Lynch  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [22]:
cast_7 = cast[(cast["title"] == "Sleuth") & (cast["year"] == 1972)]
cast_8 = cast_7.sort_values(by='n')
cast_8[['name', 'n']]

                       name    n
1654402    Laurence Olivier  1.0
316652        Michael Caine  2.0
362592       Alec Cawthorne  3.0
1421434  John (II) Matthews  4.0
2635708  Eve (III) Channing  5.0
1405219        Teddy Martin  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [23]:
cast_9 = cast[(cast["title"] == "Sleuth") & (cast["year"] == 2007)]
cast_10 = cast_9.sort_values(by='n')
cast_10[['name', 'n']]

                        name    n
316653         Michael Caine  1.0
1254632             Jude Law  2.0
1751872        Harold Pinter  3.0
251883       Kenneth Branagh  NaN
362593   Alec (II) Cawthorne  NaN
2635707    Eve (II) Channing  NaN
3244050    Carmel O'Sullivan  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [24]:
cast_11 = cast[(cast["title"] == "Hamlet") & (cast["year"] == 1921)]
len(cast_11)

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [25]:
cast_12 = cast[(cast["title"] == "Hamlet") & (cast["year"] == 1996)]
len(cast_12)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [28]:
cast_13 = cast[(cast["character"] == "Hamlet")]
len(cast_13)

92

### How many people have played an "Ophelia"?

In [33]:
cast_13 = cast[(cast["character"] == "Ophelia")]
cast_13["name"].nunique()

109

### How many people have played a role called "The Dude"?

In [35]:
cast_14 = cast[(cast["character"] == "The Dude")]
cast_14["name"].nunique()

18

### How many people have played a role called "The Stranger"?

In [37]:
cast_15 = cast[(cast["character"] == "The Stranger")]
cast_15["name"].nunique()

201

### How many roles has Sidney Poitier played throughout his career?

In [42]:
cast_16 = cast[(cast["name"] == "Sidney Poitier")]
len(cast_16)

43

### How many roles has Judi Dench played?

In [44]:
cast_17 = cast[(cast["name"] == "Judi Dench")]
len(cast_17)

54

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [51]:
cast_18 = cast[(cast["name"] == "Cary Grant") & (cast["year"] >= 1940) & (cast["year"] <= 1949) &(cast["n"] == 2)]
cast_18

                   title  year        name   type    character    n
845513  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
845523    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [52]:
cast_19 = cast[(cast["name"] == "Cary Grant") & (cast["year"] >= 1940) & (cast["year"] <= 1949) &(cast["n"] == 1)]
cast_19.sort_values(by='year')

,title,year,name,type,character,n
845539,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
845495,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
845541,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
845528,Suspicion,1941,Cary Grant,actor,Johnnie,1.0
845543,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
845519,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
845486,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
845511,Mr. Lucky,1943,Cary Grant,actor,Joe Adams,1.0
845512,Mr. Lucky,1943,Cary Grant,actor,Joe Bascopolous,1.0
845520,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
845478,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
845515,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
845514,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
845517,Notorious,1946,Cary Grant,actor,Devlin,1.0
845535,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
845536,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
845510,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
845490,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
845499,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [54]:
cast_20 = cast[(cast["type"] == "actor") & (cast["year"] >= 1950) & (cast["year"] <= 1959)]
len(cast_20)

155058

### How many roles were avilable for actresses in the 1950s?

In [56]:
cast_21 = cast[(cast["type"] == "actress") & (cast["year"] >= 1950) & (cast["year"] <= 1959)]
len(cast_21)

56412

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [60]:
cast_22 = cast[(cast["year"] <= 1980) & (cast["n"] == 1)]
len(cast_22)

64095

### How many non-leading roles were available through from the beginning of film history through 1980?

In [63]:
cast_23 = cast[(cast["year"] <= 1980) & (cast["n"] > 1)]
len(cast_23)

658350

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [65]:
cast_24 = cast[(cast["year"] <= 1980) & (cast['n'].isna() == True)]
len(cast_24)

439134